In [2]:
import pandas as pd

In [3]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
            'last_name': ['Miller', 'Jacobson', '.', 'Milner', 'Cooze'],
            'age': [42, 52, 36, 24, 73], 
            'preTestScore': [4, 24, 31, '.', '.'], 
            'postTestScore': ['25,000', '94,000', 57, 62, 70]}

df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])

In [4]:
print(df)

  first_name last_name  age preTestScore postTestScore
0      Jason    Miller   42            4        25,000
1      Molly  Jacobson   52           24        94,000
2       Tina         .   36           31            57
3       Jake    Milner   24            .            62
4        Amy     Cooze   73            .            70

**1. Save the data frame into a .csv file as "project.csv"**

In [7]:
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df.to_csv("project.csv")

**2. Read the project.csv file and print the data frame.**

In [8]:
df = pd.read_csv("project.csv")
df

   Unnamed: 0 first_name last_name  age preTestScore postTestScore
0           0      Jason    Miller   42            4        25,000
1           1      Molly  Jacobson   52           24        94,000
2           2       Tina         .   36           31            57
3           3       Jake    Milner   24            .            62
4           4        Amy     Cooze   73            .            70

**3. Read the project.csv file without column heading.**

In [10]:
df = pd.read_csv("project.csv", header = None)
df

     0           1          2    3             4              5
0  NaN  first_name  last_name  age  preTestScore  postTestScore
1  0.0       Jason     Miller   42             4         25,000
2  1.0       Molly   Jacobson   52            24         94,000
3  2.0        Tina          .   36            31             57
4  3.0        Jake     Milner   24             .             62
5  4.0         Amy      Cooze   73             .             70

**4. Read the project.csv file and make two index columns, namely, ‘First Name’ and ‘Last Name’.**

In [15]:
df = pd.read_csv("project.csv", index_col = ['First Name', 'Last Name'], names = ['UID', 'First Name', 'Last Name', 'Age', 'Pre Test Score', 'Post-Test Score'])
df

                      UID  Age Pre Test Score Post-Test Score
First Name Last Name
first_name last_name  NaN  age   preTestScore   postTestScore
Jason      Miller     0.0   42              4          25,000
Molly      Jacobson   1.0   52             24          94,000
Tina       .          2.0   36             31              57
Jake       Milner     3.0   24              .              62
Amy        Cooze      4.0   73              .              70

**5. Print the data frame in a Boolean form as True or False. True for Null/ NaN values and false for non-null values.**

In [18]:
df = pd.read_csv("project.csv", na_values = ['.'])
pd.isnull(df)

   Unnamed: 0  first_name  last_name    age  preTestScore  postTestScore
0       False       False      False  False         False          False
1       False       False      False  False         False          False
2       False       False       True  False         False          False
3       False       False      False  False          True          False
4       False       False      False  False          True          False

**6.Read the data frame by skipping the first 3 rows and print the data frame.**

In [20]:
df = pd.read_csv("project.csv", skiprows = 3)
df

   2  Tina       .  36 31  57
0  3  Jake  Milner  24  .  62
1  4   Amy   Cooze  73  .  70